[
  {
    "title": "12 Principles of Agile",
    "img": "12-agile-principles.png",
    "content": "Ensuring customer satisfaction through continuous and early delivery of impactful software is the highest priority. Customers will typically have an idea of how they want their software product to function and/or look but never all of the details. Giving the customer functional software in segments throughout the development process allows them to give feedback and change requirements if the project is not going in a direction they like. Although it may seem like a bad thing, this allows the team to make changes on portions of software rather than the entire finished result of the project. This also allows the customer to see progress, which is vitally important to keeping them happy. Accept and welcome changes in requirements at any stage of development, even the later stages. Agile processes improve the customer’s competitive advantage by using change. Changes in requirements can occur for a variety of reasons. The customer could have a change in specific needs the software product will fulfill. The users may need more functionality or a simpler design. The current requirements may not be possible to deliver on considering the time and cost constraints. As an agile team leader, you must be able to adapt to changing requirements as they can come at any time in the development process. You must also be able to quickly relay changes in requirements to your team and redesign the project. Deliver software that is functional quickly and often. Time frames vary from a couple of weeks to several months. Shorter time frames are typically preferred over longer ones. Software deliverables must be able to function on their own within their given timeframe. This allows for feedback from sponsors, as mentioned earlier. Continuous deployment also allows for feedback from users. Business professionals as well as developers must work together on a daily basis over the course of the project’s development. As an agile team leader, it is your job to be the bridge between the business and technical personnel involved in the project. This means being able to understand and sometimes assist with development. You must also be able to communicate technical information such as issues, progress, etc with business professionals. You must also be able to communicate business needs and causes for changes in requirements to your team. Being able to bridge the gap in technical vs. business knowledge is your most vital task. Projects must be built around motivated people. Agile team leads should provide the environment and support necessary to accomplish their tasks. Leads must also trust their team members to execute quality work. Your team members are the lifeblood of your project. Without an environment that motivates them and gives them space to get work done, how can you expect them to remain effective? This is where your previously mentioned communication skills come in. You have the power to tell business professionals what is necessary to build an environment that allows your team to execute the project. You can also manage burnout as this leads to a lack of motivation and therefore a harder time getting work done. Face to face conversation is consistently the best way to convey information and communicate within a development team. Although we live in the 21st century with phones and video calling technology, face to face is hands down the most effective communication method between agile teams. You are more effectively able to solve problems because of the ability to collaborate on a white board or using one person’s computer to debug. Additionally, many things that make face to face communication so effective, like body language, are lost even over video meetings. Face to face is the best way to make sure everyone is on the same page and resolve disagreements when they arise. Software that is functional is the main measure of progress. Agile methodology focuses on delivering working chunks of software. While you can use other metrics to measure progress, functional software will show you, your team, and the customer how much has been completed and how much work is left to be done. Developed and tested software must be delivered in order to get customer and user feedback which is why there is such an emphasis on delivering functional software. Users cannot provide valuable feedback on something that does not work. Agile makes the development process sustainable.  The sponsors, developers, and users should theoretically be able to maintain their pace indefinitely. If you find yourself or your team members burning out or pleading for the relief of being finished with the project, you are not executing agile effectively. You must spread the workload out in a way that is reasonable for your team, the sponsors, and yourself. While there is an expected delivery date for the final product, changes can occur at any time that can push that date further into the future. The environment and workload for agile must be set up in a way that is manageable for everyone involved. Agility is enhanced by repeated attention to technical excellence and good design. You will save a lot of time if you focus a lot of attention on good design. Additionally, your project should be designed in a way that allows for changes in requirements in the future. Technical excellence will help cut down on errors in the future which will also save time for both you and your team. Simplicity – doing as little work as possible to accomplish a task effectively – is a must in agile development environments. Teams that self-organize often create the best architectures, designs, and requirements. Self-organized teams are able to create the best architectures, designs, and requirements because they are intimately familiar with the technical and non-technical details of the project. Good architecture stems from good requirements. Good requirements originate from people with a deep understanding of the problem they are attempting to solve while also understanding the current capabilities of technology. Good designs come from people who are passionate about what they are working on and having the freedom to execute however they want. The team regularly reflects on their current effectiveness and how to improve in the future. The team then adjusts its practices according to the results of reflection. When you reflect on the prior sprint with your team, you should discuss any challenges in communication, workload, and the environment that may be preventing your team from reaching its full potential on the project. You should also elaborate on what things your team is doing well to execute effectively. These reflections are also a chance to congratulate your team members and truly make them feel appreciated. However, simply reflecting is not enough to remain effective. The team must be willing to implement changes found throughout the reflection process. Being adaptable to change is what makes agile teams thrive.",
    "author": "Kaleb Dean",
    "url": "/it-project-management/pages/12-agile-principles.html",
    "keywords": [
      "sprint0",
      "agile"
    ]
  },
  {
    "title": "When to use or not use Agile",
    "img": "Waterfall-VS-Agile.jpg",
    "content": "Agile is an effective approach to software development that has its perks when utilized correctly. Organizations and companies must know the importance of when to use or not use the principles of Agile into their products. Using the methodology when unnecessary can lead to a waste of time and resources for the organization (and vice versa). It is important to go over several of the reasons and scenarios on when to use and not use Agile methodologies.   The first reason not to use Agile practices is if the project is not required to be completed in a timely manner and/or not as complex to complete. The methodologies of Agile are best suited for more complicated and larger projects that are demanded by the client. If the development team is working on a simple project, they would be better off adopting a Waterfall approach to completing the project. With simpler projects, there will be better defined goals and less changing requirements to deal with. The purpose of Agile is to make a neat and organized project development process that is highly adaptable to the ever-changing requirements made by the client. If the goal is clearly defined and given plenty of time to complete an assigned project, it is best to not utilize Agile approaches.  The team is not well-educated on Agile and/or the organization does not invest in teaching Agile methodology for their developers and managers. In order to effectively practice Agile methodologies, it is important that a well-versed team knows how to carry out the tasks of Agile. The process will require many crucial decisions made by team members, and if the team members are not well-versed or capable enough, it would cause catastrophe to the project or product. Agile requires constant collaboration between the client, management, development team, and anyone else involved in the project. One team that does not pull their own weight will greatly affect the quality of the final product.  It can be even worse if the organization does not invest its time and resources to train their teams about Agile methodologies. Some organizations have a preference for clients that prefer traditional development methodologies. If the organizations that do not practice Agile do land a client that wants to work in Agile, they will find that the resources and interaction base for a successful Agile project would be almost nonexistent.   The clients and teams are not wanting to partake in working together for the project or interested in using Agile for their project. The utilization of Agile needs interaction between clients and teams involved with the project. Teams are expected to give helpful feedback and updates about the project to the clients. Teams are also expected to work with each other frequently and provide feedback to help advance in the project. If the client is not available to work with the project teams or if the teams do not wish to frequently collaborate with each other, then it is best to use a different approach other than Agile to complete the project assigned. It is also important to know that project teams and clients may agree that Agile is not the best approach to completing a given project. There can be a variety of reasons to reject the use of Agile, whether it is due to personal reasons or clients that want to remain in control of their projects. It is imperative that Agile is not utilized where there is no use for the approach.  The last reason why utilizing Agile methodologies would not be ideal would be if the client requires approvals or documentation per increment of development. If the project teams are working with bureaucratic organizations or clients that strongly believe in other, more traditional methodologies, then it is best to not use Agile in these instances. Having to submit a detailed report of each cycle or stage of the development process would be best for supporting processes over an extended period of time. These scenarios would best work under the Waterfall approaches to completing projects, not Agile. Having to acquire approvals for each stage of the development process would mitigate any sort of momentum that is currently going for the project, so it is best to use more traditional approaches than Agile.   The first reason to use and practice Agile methodologies is that it reduces maintenance tasks. Agile reduces the amount of tasks required to support the product. These tasks may include testing and debugging of the product during the development process. If the teams are using traditional approaches to the product, these tasks can quickly increase just to keep pace with the timeline of the project. In Agile development, defects or other maintenance tasks are put into the product backlog. This backlog is reviewed during the sprint planning sessions held during the development process, which means new opportunities to resolve issues or add new features to the product. Agile can quickly adapt to any sort of changes that come throughout the development process. Agile development recognizes that the needs of the client can change over time and well-versed teams must be able to adapt to accommodate those changes. Teams would not have to wait on review or approval processes; they can just add tasks to the backlog and allocate those tasks when a new sprint comes based on the priorities and needs of the client.  The last reason why Agile development can be utilized is that the approach is an effective way to enhance project control. Teams collaborate with each other to find out what occurs in each sprint. This ensures that the collaborating teams are up to date and knows what tasks need to be completed at hand. Standup meetings are daily and ensure everyone knows the current state of the project, as well as the ability to address issues quickly. Lastly, teams are transparent with each other and can adapt quickly to changing circumstances, which result in the completion of maintenance tasks, higher client satisfaction, and a better quality product. Agile has its pros and cons that vary between projects. It is imperative that organizations and teams are aware of when to utilize Agile methodologies to complete projects, as it can lead to a better product all around or potentially ruin the final product based on given requirements.    Resources:  https://hygger.io/blog/when-not-to-use-agile/  https://www.h2kinfosys.com/blog/when-not-to-use-agile/",
    "author": "Daniel Cisneros Siliezar",
    "url": "/it-project-management/pages/use-agile.html",
    "keywords": [
      "sprint0",
      "agile"
    ]
  },
  {
    "title": "Agile Vs Waterfall: Which methodology to choose?",
    "img": "Agile-vs-Waterfall-infographic.png",
    "content": "So you have got a team project and are planning to start working on it when you run into the decision of choosing which project management methodology you should use. Although there are many choices to choose from, the two popular choices are Agile and Waterfall. When it comes to deciding which methodology to choose from for your project, the choice is not always simple, since one will perform better for certain projects than others. Then how can one decide which one to use? In order to answer that question, we need to dive deeper into each methodology. The waterfall methodology is a more traditional and linear approach to project development, where the flow of the project stages is sequential and pre-determined. Waterfall is one of the original methods employed for projects. The method requires that all the project requirements and constraints are known from the beginning, before the project even starts. The Project Manager communicates with the users and the client to create a detailed understanding of the requirements of the project. Then, the project flows “down” different project phases including requirements, design, implementation, verification, and maintenance, in a sequence.  The waterfall methodology comes with its advantages, that include: Errors in design are caught before moving onto the software phase, thus saving time. Documentation is very easy and simple. The different stages of the methodology are predefined and easy to understand. Since requirements are already specified, testing and cost evaluation is much easier However, this methodology does have its limits, such as: Clients do not fully understand what they want. They may find it difficult to explain what they want or genuinely not know what they need until they see the application. It is very difficult and expensive to make changes to the application down the road. Once requirements are established in the beginning, there is not changing them.  The project can take longer to deliver as all stages must be completed before the application can be ready. Source: https://www.umsl.edu/~hugheyd/is6840/waterfall.html , https://www.wrike.com/project-management-guide/agile-methodology-basics/#agile-vs-waterfall-project-management It was due to these challenges with the Waterfall methodology, that new alternatives started emerging, with one of the most popular choices being the Agile methodology. An Agile methodology is an iterative form of project management, where the project is divided into “sprints”. Indeed, this methodology allows for changes in requirements throughout the life of the application as more information and feedback is received. A small part of conceptualizing, designing, developing and maintenance is included in every sprint. This also allows for a “minimum viable product” to be delivered, which is a pre-mature yet usable implementation of the application. This means that the project can be completed quicker as changes can easily be introduced in the next sprint. There are many different kinds of Agile methodologies, such as Scrum, Extreme Programming and Test-Driven Development, which are more popular than others. Scrum: Scrum, originally a rugby term abbreviated from scrummage, is a kind of methodology which makes use of stopping and restarting the project “sprints”. It has fairly short development cycles, commonly around 30 days. The output of each cycle should be a deliverable. Extreme Programming: Although extreme programming sounds like a programmer may be required to have an adrenaline rush while programming, its not so. Extreme programming is a highly change-based programming approach. A pair of programmers work together on implementing customer specifications early on. Then, the application is put through tests derived from the customer to see if it is satisfactory. Requirements determining is not as significant as requirements can easily be changed later on. It also dedicates a refactoring stage to make sure the code is free of unwanted functions that may be obsolete or otherwise not useful. Test-Driven Development: Test-driven development relies on tests to be written first before any actual production code. This means that when production code is written, the tests will fail any improper code immediately, and the code will be returned to be fixed. Like other Agile methodologies, the project is broken into short stages. This allows for more efficient and robust code, even though it may take more time as other agile approaches, since tests need to be designed before development. Also, code fixes during the new development period are easier to implement than if they were pushed during maintenance. Agile methodologies gained popularity thanks to their benefits, such as: ·         Much more flexible: allow for changes to occur early and later on without a high cost. ·         Speeds up development: allows the delivery of a product to be done earlier on and uses feedback to improve requirements. ·         More feedback means that there is a lesser risk of project failure. ·         Allows for innovation. Some issues surrounding the Agile approach are:  ·         Unclear requirements. The requirements are ever changing throughout the project process. ·         It may not be the best for larger projects. ·         It allows for process and communication conflicts.  Figure 1 shows how the different stages of the Waterfall and Agile methodologies compare. Now that you are acquainted with the aforementioned methodologies, how do you decide what to choose? We observe that for a given project, where one methodology lacks, another methodology has the potential to excel. The advantages and disadvantages of Waterfall and Agile methodologies is what helps determine which methodology to use in a given project. Larger, more distributed projects will benefit from using the Waterfall methodology, since Agile methodologies are weak for larger projects. Meanwhile, Agile projects will work wonderfully for relatively smaller projects, and better allow for innovation. If the requirements are well known in the beginning of the project, the Waterfall method may be a better option. On the other hand, if requirements are not well defined in the beginning, an Agile approach would be the way to go. Figure 2 compares the key differences between the Waterfall and Agile methodologies. Since in the world of project management there is no such methodology that is “one size fit all”, there are a variety of methodologies available to choose from, each with their own advantages and disadvantages. Therefore, in order to choose between Waterfall and Agile, all aspects of the project must be evaluated to determine which methodology suits it.",
    "author": "Irzem Ahmed",
    "url": "/it-project-management/pages/agile-vs-waterfall.html",
    "keywords": [
      "sprint0",
      "agile",
      "waterfall"
    ]
  },
  {
    "title": "Benefits of Agile Methodology",
    "img": "benefits-agile.png",
    "content": "What is Agile? Agile is a methodology that is used in project management and software development. This methodology is an approach that can help teams take many iterative and incremental steps that can help create a project. These iterative and incremental steps are all short-term and produce a prototype after each cycle. During each cycle, there also will be more innovations for the project that makes each feature more efficient. There are many benefits to using the Agile methodology in a team setting.  How does Agile reduce risks? The first benefit is that it reduces a lot of risks. When a team is applying the Agile method, the theory is that it will never fail. When a project team is using Agile, they will be taking many small cycles called sprints where at the end of each sprint they deliver an unfinished product. With this in mind, the project will never fail and there are fewer risks taken because when you finish one sprint, you do a retrospective of what went well and what went wrong, with that information you can work more efficiently on the next sprint and reduce the number of risks and the chance for failure.  How does Agile increase customer satisfaction? The second benefit is that there will be an increase in customer satisfaction. When creating a product one of the most if not the most important thing is for the product to satisfy the customer. This is why Agile methodology includes customers in their decision-making process. By including customers in their decision-making process, they are able to understand what the product lacks and where they need to improve. Another way the customers are involved is when the company creates prototypes or demos for the customer to try and give feedback, with this feedback the product only becomes more efficient.  How does Agile increase adaptability? The third benefit of using Agile is increased adaptability. This means that when a company uses a methodology like a waterfall, they start with the planning and stick with that planning for the rest of the project. This hinders the project because if there were new innovations that come out, then the waterfall method would not be able to adapt those new innovations since in the planning phase those innovations were not involved. When it comes to Agile since there’s a cycle, once a sprint is done, in the next sprint you can incorporate those new innovations into that sprint which can not only save a lot of time and resources but also make the project more up to date if there are any needs to update in the future.  How does Agile increase team morale? The fourth benefit of using Agile is that it improves team morale. In Agile you are required to do sprint meetings with your project team, there are daily sprint meetings that happen at the start of the day to discuss what is done and what has to be done. During these meetings, the team members get to interact with each other and they learn and grow together due to these interactions. The team is much closer to each other and they are able to discuss any problem they have with their work and have a strong understanding that if they need help they have people that can help them. With this in mind, the team morale is always strong and the productivity of the team is very efficient.  How does Agile increase the quality of the product? The fifth benefit is that there is an increase in product quality when using Agile methodology. This goes back to how adaptable the Agile method is, when you keep doing this iterative process, the team together grows and learns more skills that will help with the project, and because it is an iterative process you can include those new skills to make the project work more efficiently. With each sprint, the team produces a kind of prototype that will have a lot of functionality that the final product will. Over many sprints, the quality of the product will only increase because there will be many additional innovations that will be talked about in the retrospective of each sprint. Other team members can also pitch in and share their thoughts and ideas to better the product in the next sprint. With this in mind, the product will only progress forwards rather than having many setbacks. The Agile method is made so that those setbacks that the team members can experience during the sprints will be brought up at the end of the sprint and can be discussed to fix the upcoming sprint by the other team members.  How does Agile increase visibility between the CEO and their teams? The sixth benefit of the Agile methodology is increased visibility. All increased visibility means that in a company/organization, the leaders of the company are able to see and know what is going on for each project management group and see if they have any feedback or inputs to give. In many organizations/companies, visibility is very important because the CEO or the leaders of the company are the ones making the decisions, and then the teams working for that company follow. When the leaders know what is going on, what is being worked on, and what will be worked on, the company's leadership will increase and the organization as a whole will be more strategic and coordinated. Everyone in the company will be able to benefit from this attribute since the leader will be able to make decisions that not only benefit the company but each and every individual that works for the company to make their upcoming projects successful. What are the main concepts of Agile?  All of the benefits listed will serve helpful to any company that adopts the Agile and methodology. When Agile is put into practice, the company as a whole will be able to benefit from its concepts. These concepts in Agile are mainly based on things like bettering quality, constantly improving the project in every iteration, and being flexible to the changes that happen within and outside of the company, in terms of technological improvements and the transparency where people from the CEO of the company to the customers of the product all know what is going on during these projects. The Agile methodology makes it so that the customers can test out the product and give feedback, all while involving the CEO so they can make smarter decisions that will only benefit the company as a whole.  Resources https://kissflow.com/project/agile/benefits-of-agile/ https://www.planview.com/resources/guide/agile-methodologies-a-beginners-guide/benefits-agile/ https://www.atlassian.com/agile",
    "author": "Shawn Kiruba",
    "url": "/it-project-management/pages/benefits-agile.html",
    "keywords": [
      "sprint0",
      "agile"
    ]
  },
  {
    "title": "Importance of Agile Scope Management",
    "img": "scope-importance-1.jpg",
    "content": "In an agile project, flexibility and change should be on the forefront of your mind as a team lead. Requirements and specifications will constantly be modified by either your client or user base. While these suggestions are necessary for improving your project, some of them may not be possible due to time, cost, and resource constraints. Project scope management helps to limit the scale of the project to stay within the bounds of time and resources.   All projects suffer from scope creep, where the desired features and possibly functions increase over the course of development. Scope creep has caused many projects to fail. Not because the team was not working hard enough or because the initial scope was too grand, but because the scope increased to an unsustainable margin given the project’s time and budget constraints. Due to the flexible nature of agile methodology, agile projects suffer the most from scope creep. The best countermeasure for scope creep is very deliberate scope creation during the planning phase and scope management during the development phase.   Scope in project management is typically made up of several components:  The goals to be accomplished by the project’s creation Deliverables of the project Features to be implemented by the project Functions of the project Deadlines set by the project’s client  Budget for costs associated with the project’s development  Goals The goal or goals of a project are what the organization is setting out to achieve with its completion. This can be to save the business time or money in its ongoing processes, creating a product to make some task more convenient for the user base, or in the case of this website, to provide Project Managers with information about agile methodology. Typically, these goals do not change very much over the course of the project’s development.  Deliverables The deliverables of a project are the specific end results of the project. This can be a web or mobile application, upgraded hardware for a business, or in the case of this website, a blog. The specifications of the deliverables may change over the project but the desired deliverable is typically set during the planning phase.  Features In an agile project, you can be sure that the desired features will change. Good scope management prioritizes features based on necessity to the project and end users. Some features may not be able to be completed without having to push back the project’s release date. Other features may not be able to be developed given the budget. Agile scope management focuses on estimating potential features based on a fixed budget and project completion date.  Functions The functions of an agile project refer to what the end result of the project will be used for. This may also change over time. However, scope creation and monitoring keeps the functions of the app manageable enough for the project to be completed.  Deadlines In agile project management, deadlines are one of the two most important factors in managing scope. To keep your client happy, timely delivery of the end result should be your highest priority. However, this limits the potential features that may be included in the project. As mentioned earlier, some features that have a lower priority may be left out of the end result to meet time constraints. You should go into your project planning with the mentality that deadlines are fixed. This will give you the highest likelihood of meeting them and satisfying your customer. Additionally, because of the modularity of agile project deliverables, lower priority features can be implemented after the completion date as different versions of software to make users happy.  Budget This is the other most important factor of managing scope. If a feature will put you wildly over the budget, you cannot implement that feature. You will have to put your problem solving expertise to work to find another solution to the problem that feature is trying to solve. Budget is another constraint that is typically fixed during the planning phase in agile development.  How is Scope Different in Agile Projects? In waterfall methodology, the costs and time constraints are estimated, while the features and functions are fairly set during the planning phase. In agile methodology, on the other hand, this prioritization of the factors of scope is flipped on its head. The budget and deadlines are fixed during the planning phase. While features and functions are subject to change over the course of development.  Good scope management requires you to decide whether or not a feature is possible to be completed in the given time frame and budget. You also have to communicate why you may not be able to accept a new requirement. This is one of the more challenging parts of your job. However, with proper navigation between the technical and business aspects of the organization, it is possible to get your client or superior to understand. On the other hand, you should expect for the scope of the project to change over time. This is the nature of projects and the strength of agile methodology because each sprint delivers a functional segment of software. New requirements can be relatively more simple to implement in an agile project because said requirements can be broken down into modules and integrated with the overall system.   Key Takeaways Scope will change over the course of a project’s life cycle. However, scope creep can kill your project. You need to be very deliberate in managing the scope to prevent outrageous scope creep. Project scope is made up of goals, deliverables, features, functions, deadlines, and budget In agile scope management, deadlines and budget are fixed while the rest of scope is estimated given these constraints. Good scope management requires communication with your superiors or clients   Essentially, your job as an agile project manager in relation to scope is creating the scope given budget and time constraints during the planning phase of the project. In addition to this, you must understand that the scope will increase during the development phase but you must determine which features are possible to be developed under the given constraints. You must also communicate this with your superiors and client.",
    "author": "Kaleb Dean",
    "url": "/it-project-management/pages/agile-scope-management-importance.html",
    "keywords": [
      "sprint1",
      "agile",
      "scope"
    ]
  },
  {
    "title": "Scope Definition and What is a Project Scope Statement",
    "img": "project-scope-management.jpg",
    "content": "In Agile project management, it is important to be as flexible as possible and to define a scope for the project.",
    "author": "Daniel Cisneros Siliezar",
    "url": "/it-project-management/pages/scope-definition.html",
    "keywords": [
      "sprint1",
      "agile",
      "scope"
    ]
  },
  {
    "title": "Planning scope management to project managers in Agile",
    "img": "scope-management.jpg",
    "content": "Simply put, project scope management is a way of creating outlines that will help create the project's final product.",
    "author": "Shawn Kiruba",
    "url": "/it-project-management/pages/scope-management.html",
    "keywords": [
      "sprint1",
      "agile",
      "scope"
    ]
  },
  {
    "title": "Creating a Work Breakdown Structure",
    "img": "work-breakdown-structure.jpg",
    "content": "Intro As an agile project manager, the task of organizing projects with multiple deliverables, teams, and deadlines can be overwhelming. One must keep track of the entire workflow to ensure that everyone is on the same page. That's where a work breakdown structure, commonly abbreviated as WBS, comes in. A work breakdown structure helps to visualize the hierarchical grouping of work in a project based on deliverables. Since projects can be complex with many different people working on different deliverables, it becomes important to logically divide the work based on how it will be done. WBS is a tool to facilitate exactly that. What it is The work breakdown structure (WBS) is a way of organizing and dividing the work involved in a project into smaller, manageable parts based on the project's deliverables. The WBS is important in project management as it serves as a foundation document for planning, scheduling, budgeting, and managing project resources and changes. It outlines the total scope of the project, so it's important to develop a comprehensive WBS to ensure that no work is done outside the scope of the project. According to some project management experts, work should only be carried out if it is included in the WBS, making the creation of a complete WBS a critical step in project management. A work package is the smallest task in a project, and it defines the level of work that will be monitored and controlled by the project manager. The length of the work package can vary depending on the duration of the project and the frequency of progress reports. It can represent a weekly or monthly effort, or even the procurement of a product. It should be defined clearly to help the project manager estimate the effort, cost, and quality of the results. The analogy approach: The analogy approach is a method used in project management to estimate project workload, time-range, and cost by comparing a current project to a similar project that's been completed before. Since similar projects have similar qualities, data from the previous project can be used to estimate the effort and cost for the current project. The analogy approach is particularly useful when detailed information about the current project is not yet available or when the project is similar to previous projects in terms of size, complexity, and technology. Thus, the project manager may infer project effort, duration, and cost by using data from past projects. These estimates may be adjusted as new information becomes available. The top-down approach The top-down approach in project management is a method of breaking down a large project into smaller, manageable parts by starting with the end goal and breaking it down into smaller deliverables and tasks. The first level comes from the enterprise-level stakeholders to the project manager and leadership team. The main focus of the enterprise is profitability, and projects are conducted to either make or save money. To achieve the desired outcome, the enterprise must communicate its requirements effectively to the project team. The second level of top-down focuses on the importance of time to market and return on investment (ROI). An enterprise wants to develop products and services quickly, and a lower development cost leads to a quicker return on investment and increased profits. The top-down approach is beneficial because it allows project managers to ensure that all aspects of the project are accounted for and to create a clear and comprehensive plan for completion. However, it does require a strong understanding of the project goals and a high level of detail from subject matter experts in order to be effective. The bottom-up approach The bottom-up approach is a less structured method of project management that involves individuals from different teams sharing a list of activities to be completed. In this approach, the project manager gathers information through workshops or emails and asks for details about each activity, the involved parties, and the desired outcome. Although this method may result in gaps due to the lack of logical sequencing, it can lead to discovering tasks that were overlooked in the top-down approach. The bottom-up approach may also be beneficial in situations where the type of project is new and there is a lack of in-house expertise. The mind mapping approach Tony Buzan was the first person to introduce the concept of mind mapping in 1974. He believed that mind mapping could be a useful tool to encourage creativity and to help individuals make use of their creative and holistic abilities. Mind mapping can also be effectively used in project planning, particularly at the Work Breakdown Structure (WBS) stage. During the WBS stage, the project team develops a hierarchical task list to detail their selected plan. Mind mapping can be used to generate this WBS by asking \"What are all of the things we need to do to complete the project?\" The WBS can be created through a group brainstorming session, which is most effective with 4 to 7 team members who have a significant stake in the project. If the WBS contains many deliverables, the mind mapping activity can be conducted in stages, first creating a map of all deliverables and then developing sub-project mind maps for more detail. Conclusion In conclusion, the Work Breakdown Structure (WBS) is a crucial tool in project management as it helps break down the project into smaller, manageable parts based on the project's deliverables. We mentioned different approaches, such as the analogy approach, top-down approach, bottom-up approach and mind mapping, project managers can generate a Work Breakdown Structure. By using these approaches, project managers can create a comprehensive WBS that outlines the entire project, making it easier to plan, schedule, budget, and manage project resources and changes. A good project manager ensures they do their best to determine and create the right WBS for their project. Indeed, a good WBS allows for better project organization, improved team communication and overall efficiency. Do not forget to use these tips to become a better Project manager!",
    "author": "Irzem Ahmed",
    "url": "/it-project-management/pages/creating-work-breakdown-structure.html",
    "keywords": [
      "sprint1week1",
      "agile",
      "scope"
    ]
  },
  {
    "title": "Activities: The basis of developing a project schedule",
    "img": "activities-schedule-basis.jpeg",
    "content": "As an agile project manager, activities will make your schedule development process a lot easier. This article will help you understand the importance of activities as the basis of developing project schedules by answering the following questions: What are activities in agile project management? How can activities be used as the basis of project schedule management? How is workflow without activities? How is workflow improved with activities? How do activities make better schedules?  What are activities in agile project management? An activity is the smallest functional component of a project management plan. Activities are made up of smaller tasks. These tasks usually need to be completed in a specific order, although this is not always the case. Another term for project activity is a deliverable. In agile, these activities need to be able to integrate with the system but be fully functional. Using this blog site for example, the home page was the first activity. It needed to be accessible and have the necessary components to display article previews within cards. Another activity in the schedule for this blog was to include a search functionality. This needed to be fully functional by the start of sprint 0 but also needed to interact with the rest of the site. The other activities included styling and writing as well as posting the articles every week. These articles are functional on their own but mesh together with the rest of the site to build the entirety of the blog.  How can activities be used as the basis of project schedule management? Activities are used as the basis of project schedule management by creating blocks of associated work that can be estimated individually. These defined activities can then be ordered based on priority and dependencies. For example, our team had to determine how to host this blog before we could build the homepage. We also had to build the homepage before the template for articles because the style of the articles were dependent on the styling of the homepage. Additionally, we had to create a template for the articles before writing each article to create a consistent style. All of these activities helped break down the overall task of “create a blog site for project managers” into bite-sized segments that could be completed in the required amount of time.  How is workflow without activities? Without project activities, the workflow has the potential to be more disorganized. This is due to the fact that there will be so many small tasks for the team to complete, it will be hard to organize them in a way that can be easily estimated. This can be a problem when communicating with the client or members of the business side of your organization because they want clear timeframes of when to expect results. Additionally, without activities, agile is not possible. One of the key pillars of agile development is developing fully functional increments of software. Activities are the plans of those fully functional increments as well as any actions necessary to ensure those sections are able to be completed. For example, if any resources need to be procured from another team or organization, this would be an activity. Without activities, the workflow is more disorganized and harder to estimate.  How is workflow improved with activities? With activities, the schedule is a bit easier to create and estimate. Instead of trying to estimate the total length of unorganized tasks, using activities provides a total estimated time it will take to complete the project by calculating the sum of the duration of all activities associated. Additionally, dependencies between project activities can be more clearly mapped out after said activities are defined. For example, the styling could not be completed until our team decided where to host the site. In this case, the styling activity was dependent on the website hosting activity.  How do activities make better schedules? Activities make better schedules because they map out the predicted workflow of the project. As mentioned above, dependencies between activities can be determined which creates better schedules because you will have an idea of the order in which deliverables need to be completed. Being able to estimate chunks of the project creates better schedules because you as a project manager, the business professionals in your organization, and the client will have a better understanding of the predicted timeframe of the overall project. Activities also make better schedules because when something goes wrong and the completion of an activity is delayed, the schedule can better reflect how this will impact the start and finish dates of other activities and therefore the entire project. Additionally, a schedule with activities can be modified easier when new requirements arise.  Key Takeaways: Activities in Agile project management are the actions that need to be taken to get resources for the project and the deliverables that function as the building blocks of the planned software product. Activities can be used as the basis of project schedule management by providing blocks of work that can be more easily estimated. Activities can be grouped based on relation to one another. The overall estimated completion date of the project can be calculated by taking the sum of the estimated time to complete all the project activities while taking into consideration their dependencies on one another Project workflow without the use of activities is more unorganized and can lead to unrealistic estimates Project workflow with the use of activities is more organized and leads to more accurate estimates because the dependencies between activities can be accounted for. Additionally, a schedule with activities can more easily reflect delays in one activity and how that will affect the release of other activities as well as completion date of the project overall Activities make better schedules because they map out the predicted workflow of the project by breaking it down into smaller components. These components can be organized based on their relationships and put into chronological order easier than a schedule without activities  As an agile project manager, developing an accurate schedule is critically important for communication with business professionals in your organization and your client. Defining activities within your project and organizing them to create a schedule is extremely effective in agile development because of the modularity they provide. This is vital when working in agile methodology because of the constantly changing requirements.",
    "author": "Kaleb Dean",
    "url": "/it-project-management/pages/activities-schedule-basis.html",
    "keywords": [
      "sprint1",
      "agile",
      "activities"
    ]
  },
  {
    "title": "Activity Duration Estimates: The Essential Tools and Techniques for Project Managers",
    "img": "Ahmed_Activity_Durations_Estimating.webp",
    "content": "Intro To create good project schedules, you first need to know how long the activities within the project will take. Even before determining the total duration of a given work package, you must estimate the duration of the activities that package entails. Indeed, a good project manager uses all the tools and techniques available to measure the best possible estimates for all activities in a project. We will talk about what these techniques are, how they are used and why they are important. What are activity duration estimates? In order to better understand what activity duration estimates are, we must first find out what we mean by activities in this context and how we outline them. Activities are defined by determining specific actions involved in the production of a deliverable in detail. The detail should be enough that we may infer how much resource and time the activity entails. It is important to note that the project management plan, organizational factors, and process assets are fully reviewed and understood before the project team goes ahead and starts defining activities. It is important to note that the duration estimate includes the actual amount of time needed to complete an activity. For example, if you spend 50 hours to create a website but you do it in about 2 months, the actual duration estimate would have been noted as two months. Duration must not be confused with effort, which is the actual number of workdays or work hours needed to complete an activity. In the previous example the effort was 50 hours. Activity duration estimates are an estimation of time needed to complete an individual activity in a project. They are an important component of project planning and control and provide the basis for developing project schedules. After defining and sequencing activities, an activity duration estimate is produced. This allows for the project schedule to be produced by providing a schedule baseline, data and necessary document updates. What is the basis of this estimate? The basis of estimates is a written record of the assumptions and constraints used to create a duration estimate, as well as the methods used, the possible outcomes, and the level of confidence in the estimate. This documentation is crucial for projects because it makes the underlying assumptions and constraints clear and transparent. If an assumption becomes invalid, it may require a new estimate. The project manager can also use this document to ensure consistency across the project, justify the project schedule, and communicate with stakeholders. How is activity duration estimated? Activity duration estimates consider various factors, such as the complexity of the activity, the resources required to complete it, the skills and experience of the personnel assigned to it, and any potential risks or uncertainties that may impact its completion. To develop accurate activity duration estimates, project managers use a range of tools and techniques, such as expert judgment, analogous estimating, and parametric and three-point estimation. These methods help project managers to develop a realistic and reliable estimate of the time required to complete each activity. Inputs: When creating an estimate, there are certain key input parameters that are essential. These parameters include a list of activities and their attributes, assigned resources (including material resources and team members, along with their availability and skills), and historical data if it is available. The more the information that is considered when creating an estimate, the more accurate the estimate is likely to be. As such, also considering risk factors and having a risk register in place to identify potential risks that may impact the duration of the project allow for estimates to be more accurate. Furthermore, taking into account enterprise environmental factors, such as organizational culture or company policies, can help to provide a more realistic estimation of the resources required and potential constraints that may impact the project. By considering all these factors, the estimate will be more comprehensive and will provide a more accurate prediction of the time required to complete the project. Tools and Techniques: Expert Judgment: The duration required to finish the activity within the defined scope can be estimated by experts using either a top-down or a bottom-up approach. Analogous Estimating: Using historic market data, the current prospective activities are compared to similar activities that have been done before or are being done elsewhere and the historical duration observations are adopted. Parametric Estimating: Using parameters and values of similar projects, the historical durations per parameter infer the duration of activities to come. Bottom-up Estimating: Estimation involves starting at the smallest level and then aggregating to the higher levels using those durations. Three-point estimate. Three-point estimation is a project management technique that involves estimating the duration or cost of a project activity by using three estimates: an optimistic estimate (O), a pessimistic estimate (P), and a realistic estimate (R). Three-point estimation is a project management technique that utilizes optimistic, pessimistic, and realistic estimates to calculate the expected duration or cost of an activity. This approach incorporates uncertainty and risk factors and helps to improve the accuracy of project estimates and better manage project schedules and budgets. How they are used: Activity durations are a crucial aspect of project management that serves as the basis for creating project schedules and determining the time required for deliverables. Accurate duration estimates are particularly important for activities that form part of the critical path and have a direct impact on the overall project timeline. Furthermore, duration estimates on the activity level can help test whether the work can be performed within the given constraints, such as resources and expected outcomes. Also, they may also help with creating cost estimates as cost can be determined using the amount of time taken to do an activity and the amount of resources put in. Conclusion: Preparing the project schedule is reliant on accurately estimating activity durations. Such estimates can also be useful in the initial project phases as a means of testing high-level assumptions and making any necessary adjustments, such as resource assignments, more evident. There are many different tools and techniques at your disposal as a project manager and they all work in different ways to provide a good activity duration estimate.",
    "author": "Irzem Ahmed",
    "url": "/it-project-management/pages/activity-duration-estimates.html",
    "keywords": [
      "sprint1week2",
      "activity",
      "duration",
      "Estimate"
    ]
  },
  {
    "title": "Planning Schedule Management and its Importance for Agile Project Managers",
    "img": "planning-schedule-management.png",
    "content": "As an Agile project manager, it is useful to understand what schedule management is and the process of planning the schedule management throughout the project.",
    "author": "Daniel Cisneros Siliezar",
    "url": "/it-project-management/pages/planning-schedule-management.html",
    "keywords": [
      "sprint1week2",
      "planning",
      "model",
      "report"
    ]
  },
  {
    "title": "Agile and adaptive environments",
    "img": "four-pillars-of-agile.jpg",
    "content": "Learn how to create a agile environment as a project manager",
    "author": "Shawn Kiruba",
    "url": "/it-project-management/pages/agile-adaptive-environments.html",
    "keywords": [
      "sprint1week2",
      "agile",
      "adaptive",
      "environemnt"
    ]
  },
  {
    "title": "How project management software assists with project cost management",
    "img": "project-management-software-budget.jpeg",
    "content": "Creating the budget for your agile project is a critical task as an agile project manager. It helps your team assess the costs associated with the development and deployment of the project and determine whether the project’s completion is feasible given the cost constraints of your client. This is a daunting task in agile project development because there are many tasks that must be estimated in order to build an accurate budget for the project. Additionally, in an agile project, the requirements and scope can change over time which adds further variability in your budget. Project management software can assist you in developing the budget for your agile software project by offering resources as well as features that make it easier to track and manage the costs and expenses of the project for the entire course of its completion. There are several ways that project management software can simplify making a budget. Resource Planning Time tracking Agile budgeting Reporting and analytics Collaboration  Resource Planning Assigning resources to specific tasks and projects is an important part of planning the budget. Project management software provides resource management tools that simplify this process and make it more manageable. As an agile project manager, you can utilize the software’s tools to estimate resource costs, such as labor and equipment, required to complete the project efficiently. The budget can then be made according to these estimations. Resource management tools help to organize this process and can keep track of resources as new ones are added later in the project’s development.  Time Tracking Software for agile projects can help track the time required to complete certain tasks in the project development life cycle. This can help you estimate the remaining time for the project based on the remaining incomplete tasks of the project. This can be factored into the budget to estimate the cost per hour of certain services and resources. Time tracking tools provided by agile project management software can also be used as a template for future projects that are similar to the current one. Since certain tasks will be similar from project to project, the estimated time to complete these tasks will likely also be similar. This can help make a more accurate estimation for future projects because there is documentation of the time and costs required to complete certain tasks.  Agile Budgeting One of the main factors in agile projects management is the fact that requirements change constantly. This is one of the biggest challenges you will face as a project manager. Project management software can help alleviate this problem by keeping track of the estimated costs and making changes to the budget as new requirements are added later in the project’s life cycle. Project management software can take into account changes in scope as well as unknown costs that spring up during development. Project management software can also help keep you organized so you can keep track of all of these changes in one place. The flexibility of the software allows you to make changes whenever they eventually arise.   Reporting and Analytics Project management software is extremely useful in creating reports for the projects. These include: Financial reports Cost analysis Budget summaries These reports provide a clear reference of the financial status of the project. This can be used in making financial decisions throughout the course of the project’s planning and development phases. These reports can be generated automatically which gives you more time to spend on other areas of the project. Reports being generated by project management software gives you more time to complete other tasks associated with the project. One of the biggest advantages of using project management software is the amount of time it saves you as a project manager by automating some of the more tedious tasks. Reports created by project management software can also be used to more accurately reflect the costs of similar projects that you will manage in the future.  Collaboration Project management software also supports collaboration within your team, business partners, and your client. This helps ensure that everyone involved in the project’s planning, development, and deployment are on the same page when it comes to project costs. Instead of having to manually send members of the team reports or estimates, they can simply refer to the project management software to get an idea of what is going on. This is especially useful when communicating with the client because they have a full picture of the costs associated with their product. They can then revise requirements or decrease the scope if costs are getting out of hand. Everyone having access to the same information is crucial for effective communication between people involved in the project. Your team members can also provide more accurate estimates for the time required to complete specific tasks that they are assigned based on their experience in the role. Having the ability to collaborate with the team using project management software gives them the ability to share those estimates. This creates less work for you because as a project manager, you can just review and revise your team members’ estimates rather than creating them from scratch. If anyone is unsure about the remaining workload and costs associated with each task, they can simply refer to the project management software to get a better understanding.  Key Takeaways: Determining a budget is important for managing all kinds of projects, however, Agile projects can change requirements and scope so the budget must be flexible. Project management software can simplify the process of creating an accurate budget while also keeping your project’s financial status organized and clear over its life cycle. Project management software is useful for resource planning using a bottom up approach of estimating the time and costs associated with each individual task and using these estimates to determine the cost of the project. Project management software is useful for time tracking to estimate the time to complete a task and use that information to more accurately estimate the time required to complete similar projects in the future. Project management software excels at budgeting in an agile project because new costs can be accounted for and factored into the budget at any time during the project’s development. Project management software can also create automated reports which can be used to adjust the budget, requirements, and scope if necessary. These reports can be used to communicate with your client and business professionals in your organization. Reports generated by project management software can paint a clear picture of the project’s financial position and can be used to estimate similar projects in the future. Another strength of project management software is collaboration. Everyone involved in the project can be on the same page when it comes to understanding information about the project’s costs and budget because multiple people can collaborate using project management software. This also helps decrease your workload as a project manager because you can review and revise your team member’s estimates rather than guessing yourself.",
    "author": "Kaleb Dean",
    "url": "/it-project-management/pages/project-management-software-assists-project-cost-management.html"
  },
  {
    "title": "Planning Cost Management",
    "img": "cost-management.png",
    "content": "Learn how to create a cost management plan",
    "author": "Shawn Kiruba",
    "url": "/it-project-management/pages/planning-cost-management.html",
    "keywords": [
      "sprint1week2",
      "planning",
      "cost",
      "management"
    ]
  },
  {
    "title": "Cost Estimation: Different Methods and Techniques",
    "img": "Ahmed-Feb25-Project-Estimate-Screenshot.jpg",
    "content": "Discuss different types of cost estimates and methods for preparing them Intro One of the most important aspects for a project manager to consider about a project is its implied costs. A successful project manager not only attempts to identify and predict all the costs that may be incurred by the project, but also tries their best to optimize decisions to make the most of the given budget. To estimate how much different tasks will cost, project managers use cost estimation techniques. The cost estimate helps project managers allocate resources appropriately and make informed decisions about the project. So, let's dive into some of the most popular cost estimation techniques and see how they can help us keep our budgets in check. What are costs? The word \"cost\" refers to the resources that are sacrificed or given up in order to accomplish a particular goal. The quantity of the sacrifice or renounced resource is typically expressed in money, such as dollars. Cost, as used in project management, relates to the resources and money used by a project but could have been put to better use. To ensure that the project is completed on time and within budget with the least number of resources possible, project managers must be adept at managing project costs. What are cost estimates? Cost estimation is the process of estimating all the costs associated with completing a project within its timeline and scope. Initial estimates are used in the earliest stages of planning to determine if a project is feasible. Detailed estimates are needed once the project is approved to allocate resources appropriately. A thorough estimate should include direct and indirect costs such as overhead, labor, materials, equipment, and vendor fees. Why do we need cost estimates? Understanding the project cost estimate is crucial for successful planning and execution of the project. A project may be considered as a failure if it is far overbudget and does not deliver the benefits it promises for the set budget. Naturally, different scenarios may take place that will either end up in lowering or increasing costs. Together with the fact that we tend to be biased towards underestimating costs, unforeseen circumstances may increase costs to the point of becoming way over budget. Therefore, it is critical that all costs are pre-determined to the best possible estimate. A thorough cost estimation process is needed to achieve project goals and objectives set by stakeholders. The project budget includes indirect and direct costs and estimates the overall cost of delivering the project on time and meeting quality expectations. The cost estimation process considers all the necessary resources for a successful project outcome. How to calculate cost estimates? Project cost estimation can be challenging due to various factors that can affect the estimate's accuracy. Fortunately, there are cost estimating techniques available that can assist with developing more precise cost estimates. Analogous Estimating Analogous estimating is a technique used in project management to estimate the cost of a project by comparing it to similar past projects. This approach involves using historical data from previous projects that are similar in scope, complexity, and other relevant factors to estimate the cost of the current project. It helps project managers quickly develop an initial cost estimate and identify potential cost issues early in the project lifecycle. This technique is useful when there is limited information available about the current project or when the project is in its early stages. Parametric Estimating Parametric estimating is a cost estimation technique that uses statistical modeling to predict the cost of a project based on various parameters or variables. This method relies on historical data of key cost drivers, such as the cost per unit of work, and uses this data to develop a mathematical model. The model can then be used to calculate the estimated cost of a project based on the known parameters, such as the size or duration of the project. Bottom-up Estimating Bottom-up estimating is a cost estimation method that breaks down a project into smaller, more manageable tasks or work packages. Project managers estimate the cost of each individual task, including labor, materials, and other direct costs, and then aggregate the estimates to determine the total cost of the project. This method provides a more detailed and accurate cost estimate than other methods, as it considers all the specific tasks involved in the project. Bottom-up estimating is particularly useful in complex projects with many variables that can impact cost, such as software development or construction projects. It can help project managers identify potential cost risks early in the project life cycle and adjust the plan as necessary. This method also allows project managers to allocate resources more effectively, as they have a detailed breakdown of the costs associated with each task. Three-point Estimate A more probabilistic method to cost estimation is used in the three-point estimate cost estimation technique. For each project job, it entails creating three estimates: the most probable scenario, the optimistic scenario, and the pessimistic scenario. The most likely scenario is the estimate that the project manager believes is the most realistic, based on their experience and knowledge. The optimistic scenario is the best-case scenario, where everything goes smoothly and there are no delays or unexpected expenses. The pessimistic scenario is the worst-case scenario, where everything that can go wrong does go wrong, leading to delays and additional costs. Once these three estimates have been established, the anticipated cost is calculated using an equation involving them. The weighted average is considered in the calculation. The three-point estimate technique is particularly useful in situations where there is a lot of uncertainty or risk involved in the project. By developing three different scenarios and calculating the expected cost, project managers can better understand the potential range of costs associated with the project and make informed decisions based on that information. Conclusion In conclusion, cost estimation is an essential part of project management as it helps to determine the feasibility of a project, allocate resources effectively, and ensure that the project remains within budget. Different cost estimation techniques, such as analogous estimating, parametric estimating, bottom-up estimating, and the three-point estimate, can be used to develop more accurate cost estimates depending on the project's complexity and level of uncertainty. By utilizing these techniques, project managers can develop more realistic cost estimates and make informed decisions throughout the project's life cycle. ",
    "author": "Irzem Ahmed",
    "url": "/it-project-management/pages/cost-estimating-methods.html",
    "keywords": [
      "sprint1week2",
      "Estimation",
      "cost",
      "methods",
      "management"
    ]
  },
  {
    "title": "Project Cost Management in Agile: Basic Principles, Terms, and Concepts",
    "img": "PCM-Phases.jpg",
    "content": "Understand what project cost management is and its importance.",
    "author": "Daniel Cisneros Siliezar",
    "url": "/it-project-management/pages/project-cost-management-basics.html",
    "keywords": [
      "sprint2week1",
      "agile",
      "costs",
      "principles"
    ]
  },
  {
    "title": "Project Quality Management in Agile: The Basics and How it Relates to IT",
    "img": "pqm-diagram.jpeg",
    "content": "As an aspiring or current Agile project manager in the field of information technology, you may have heard of project quality management. What exactly does project quality management entail? Why is it important within the field of project management with Agile methodologies? How does it relate to the IT sector? You have a desire to strengthen your knowledge in Agile project management and to become a better project manager than before. What is Quality? The word “quality” has several definitions, such as the totality of features and characteristics of an entity that bear on its ability to satisfy stated or implied needs (International Organization for Standardization ISO8042:1994) or conformance to requirements and fitness for use. The definitions are broad and open to interpretation, so it is your responsibility as a project manager to understand your customer’s definition of quality to be successful in your organization. In regards to quality, conformance to requirements are the written specifications that products meet. An example of this would be making sure a certain number of servers with specific capabilities are suitable for delivery. Fitness for use is defined as a product that can be used for its intended purpose. An example of fitness for use is if the servers were not delivered with the proper hardware to make them function properly, then they would be deemed not fit for use. Quality should be on the same level with scope, time, and cost of a project. If stakeholders of the project are not happy with the quality of the project management or the end deliverables from the project, the team developing the project must change their scope, time, and cost accordingly. You, the project manager, should not do the bare minimum and just meet the written expectations of the project. You should have a great relationship with all stakeholders involved in the project and know what they want from it. The Purpose of Project Quality Management Now that you have an understanding of what quality can be defined as, project quality management serves a purpose to make sure that the project will meet and satisfy the requirements for which it was accepted. An important aspect of project management is to meet or exceed the needs of stakeholders. Project teams and managers should strive to make good relationships with stakeholders and the main customers behind their projects to understand what their definition of quality means. Just remember that the customer has the final say if the quality of the end product is acceptable. The Importance of Quality in Project Quality Management One question regarding information technology worth noting after defining quality and project quality management would be how does quality affect the world around us? Businesses and organizations around the world provide their employees with computer access. Many people use the Internet and our daily routines rely on high quality IT products. Computers aid in food production and distribution, performance tracking and global positioning systems in cars, education for students in schools and colleges, many functions for corporations, and entertainment or personal use for the average person. IT systems are even used in navigation systems within aircraft and provide smart capabilities to TVs, fridges, and other household appliances. IT systems are used in first responding areas that may be life or death such as military services, emergency medical services, fire departments, and law enforcement agencies. The previous paragraph alone should provide enough information on how important it is to meet quality standards in Agile project management. You can prevent extreme cases of identity theft and data breaches by maintaining high quality standards for your products. If you fail to maintain quality standards in your products, then you could potentially cost future customers from ever doing business with your organization. The Processes of Project Quality Management There are three main processes in project quality management: Planning quality management: This process identifies which requirements and standards in regards to quality are related to the project and how to meet and/or satisfy them. Implementing quality standards into a design of a project is a critical aspect of quality planning. In regards to an IT project, standards of quality may include permitting for system growth, planning for a response time that is reasonable for a system, or making sure that the system outputs accurate and consistent results. The main outputs include plans of quality management, quality metrics, project documents updates, and project management plan updates. In regards to metrics, they are a standard unit of measurement. Examples of such metrics include availability of goods and services, failure rate of products, and ratings of customer satisfaction. Managing quality: Also known as quality assurance, this process gives evidence that all activities regarding quality being completed are defined. These activities have to follow the organization’s quality regulations. This process is typically performed on the deliverables and management procedures of the project with the use of process checklists or project audits. The main outputs include quality reports, evaluation documents, change requests, project documents updates, and project management plan updates. Controlling quality: This process monitors specific results of the project to make sure that those results are complete, meet the customer’s standards, and are correct. Pareto charts, quality control charts, and statistical sampling are all tools that are utilized for managing quality in your projects. The main outputs include measurements for quality control, work performance information, change requests, verified deliverables, project documents updates, and project management plan updates. Conclusion As an aspiring or current project manager practicing Agile methodologies, you are now familiar with what project quality management is, why it is important, and how it relates to the sector of information technology. Most, if not all, organizations and businesses around the world rely on IT systems. These IT systems are used professionally or recreationally, but all must meet the high quality standards that consumers demand of them. Your goal should be to satisfy or exceed the needs of the customer and your customer is the one who ultimately decides what the meaning of quality is for your project. References Information Technology Project Management book by Kathy Schwalbe 9th Edition https://business.adobe.com/blog/basics/quality-management",
    "author": "Daniel Cisneros Siliezar",
    "url": "/it-project-management/pages/project-quality-management-meaning.html",
    "keywords": [
      "sprint2week2",
      "agile",
      "quality",
      "importance"
    ]
  },
  {
    "title": "Quality Management",
    "img": "quality-management.jpg",
    "content": "Learn how to create a effective quality management team",
    "author": "Shawn Kiruba",
    "url": "/it-project-management/pages/quality-management.html",
    "keywords": [
      "sprint2week2",
      "quality",
      "management"
    ]
  },
  {
    "title": "Exploring the Outputs of the Quality Control Process",
    "img": "Ahmed-mar11-qcgraph.drawio.png",
    "content": "Introduction: Quality control is an essential process that ensures that products and services meet the specified quality requirements. The quality control process involves various stages, such as inspection, testing, and corrective action. The outputs of the quality control process are critical in maintaining the overall quality of the products and services. In this blog, we will discuss the main outputs of the quality control process. Project Quality Management So, what is Project Quality management? Project quality management refers to a set of processes, tools, and techniques that are used to ensure that a project's processes and products meet the quality requirements and standards that are relevant to the project. Quality is defined as the totality of characteristics of an entity that bear on its ability to satisfy stated or implied needs. Project quality management involves planning, managing, and controlling the quality of a project, and it must be on an equal level with project scope, time, and cost. The purpose of project quality management is to ensure that the project will satisfy the needs for which it was undertaken, and the main outputs of project quality management are a quality management plan, quality metrics, quality reports, test and evaluation documents, change requests, project management plan updates, project documents updates, quality control measurements, verified deliverables, and work performance information. Quality Control Measurements: The results of the quality control procedure within project quality management are quality control measurements. Measurements of quality control are used to ensure that particular project outcomes are complete, accurate, and up to par with client expectations. Performance metrics, defect counts, error rates, and client happiness scores are just a few examples of the quality control metrics that can be used. These measurements are used to evaluate the project's advancement and identify any necessary corrective action to get it back on schedule. In order to make sure that the project's products and procedures adhere to the quality standards and requirements specified in the quality management plan, quality control measurements are a crucial component of project quality management. Verified Deliverables: One of the primary outcomes of the quality control procedure within project quality management is verified deliverables. Deliverables from a project that have been reviewed and validated to make sure they adhere to the quality criteria and standards outlined in the quality management plan are known as verified deliverables. Depending on the project and deliverable, the review and validation process may entail testing, inspection, or other kinds of quality control measurements. The products are regarded as verified deliverables once they have undergone validation. Verified deliverables are crucial because they serve as verifiable proof of the project's achievement. They can be used to show stakeholders that the project is accomplishing its goals and that the delivered goods adhere to the necessary quality standards. Verified deliverables may also serve as inputs to subsequent project phases or processes, such as the monitoring and controlling process or the project closure process. Work Performance Information: The data and status information gathered during project execution that reveals how the project is progressing in terms of time, expense, scope, risks, and other important performance indicators is known as work performance information (WPI). Project managers and other stakeholders can use this data to make well-informed choices and take the appropriate corrective action to keep the project on schedule. The status of project deliverables, the quantity of work completed, the real costs spent, and the state of risks and issues are a few examples of work performance information. Work performance information includes the status of project deliverables, the amount of completed work, the remaining work to be performed, actual costs incurred, and the status of risks and problems. It is to be well known that work performance is an important yet often overlooked aspect of quality control within the scope of project management. Work performance information is often compiled into reports and presented to stakeholders during project review meetings to provide visibility into project progress and performance. Change Requests A formal request for a change to the project's scope, timetable, or budget is known as a change request. Change requests may be made for a number of causes, including adjustments to project requirements, environmental factors, or stakeholder expectations. Before any changes are made, these requests must first be officially reviewed, approved, or rejected by the relevant project authority. Project Management Plan Updates: The Project Management Plan is a formal record used in project management that lists the project's objectives, schedule, financial constraints, and risks. Updates to the project management plan are modifications made to the document in reaction to new circumstances or specifications. Updates to all plans must be carefully analyzed, understood, evaluated, and only then forwarded. Indeed, these updates are necessary to ensure that everyone is aware of the project's present situation and to keep it moving in the right direction. Project Document Updates: Project documents are important documents created throughout the project lifecycle, such as plans, reports, schedules, and specifications. Project document updates refer to changes or revisions made to these documents to reflect the current status of the project. These updates can relate to any aspect of the project, such as scope, schedule, cost, quality, or risks. It is crucial to keep project documents up to date to ensure that all team members have access to the latest and accurate information. This enables them to make informed decisions and take appropriate actions. Conclusion: In conclusion, project quality management is a crucial process that ensures products and services meet the specified quality requirements. Quality control measurements, verified deliverables, work performance information, change requests, project management plan updates, and project document updates are the main outputs of the quality control process. These outputs play a significant role in maintaining the overall quality of the project and ensuring that it meets its objectives. Keeping project documents up to date and making appropriate changes to the project management plan is essential to ensure that everyone involved in the project is aware of the current situation and that the project is moving in the right direction.",
    "author": "Irzem Ahmed",
    "url": "/it-project-management/pages/outputs-of-quality-control-process.html",
    "keywords": [
      "sprint2week2",
      "agile",
      "quality control",
      "principles"
    ]
  },
  {
    "title": "Relation Between Quality Management and Scope Management",
    "img": "quality-management.jpg",
    "content": "Relation Between Quality Management and Scope Management  Quality is a compilation of characteristics of an entity that make it possible for it to satisfy needs that are either stated or implied. Quality can also be defined as conformance to requirements. In other words, the project’s ability to meet its written specifications. Fitness for use is another way to define quality. Fitness for use is the ability of the product to be used as intended. Project quality management is used to ensure that the project will meet the client’s and users’ needs. As a project manager, it is your responsibility to manage the quality of each iteration of the project to ensure that it meets the client’s needs.  There are three main processes of quality management: Planning quality management Managing quality Controlling quality  In the planning quality management process, you will identify requirements and standards for the quality of the project. You will also discuss with your team the most effective ways to meet these standards.  In the managing quality process, you will translate the requirements and standards found in quality management planning into actions and activities that can be done by your team during the project’s execution. You will also create quality reports, documents for testing and evaluation, change requests, updates to the project management plan, and updates to the project’s documents.  In the controlling quality process, you will monitor the specific results of the project to ensure their completeness, accuracy, and ability to meet the client’s expectations. This process uses many techniques and tools such as Pareto charts, quality control charts, and statistical sampling. By controlling quality, your team will output verified deliverables, work performance information, change requests, updates to the project management plan, and updates to the project’s documents.  So how can you manage quality in your software project? In order to plan quality management, you can design experiments to help identify which variables have the greatest influence on the results of a process within your project. Understanding the underlying factors that influence the outcome of a process is important for developing good standards of quality for your project. You must also communicate the correct actions to ensure quality control in a complete and readable format.Your organization’s standards for quality are important to include in your quality management plan because your project must conform to the organizations standards. Your quality management plan should address functionality, system outputs, performance, reliability, maintainability. Functionality is the system’s ability to perform its stated function. Features are characteristics that draw users to your product. You must ensure that these features achieve a high degree of functionality and accomplish specific goals within your project. System outputs are the visible elements of the system. This includes screens and reports generated by the system. You must ensure that users can easily read these screens and the reports are in a format that is useful for your users. Performance deals with how well the product performs the intended use of the customer. To ensure a high level of performance you, your team, and the client must discuss the volumes of data and transactions that the system can manage, the number of simultaneous users, the projected rate of growth of users, the types of equipment on which the system will be deployed, as well as many other factors. Reliability is the ability of the product to perform as intended under normal conditions. Maintainability refers to how easy it is for future developers to fix or make adjustments to the software as needed.  Controlling Quality There are three primary aspects of controlling quality. These are acceptance decisions, rework, and process adjustments. Acceptance decisions are the process of choosing whether or not the module of software will be accepted for integration into the system. If rejected, the module will have to be reworked until it meets the quality requirements. Rework is any action taken to redo work that was previously completed but not up to your team’s or organizations quality standards. Process adjustments are corrective actions to ensure that quality problems do not continue in the future. Process adjustments can change the project management plan and your organization’s process assets.  There are several tools at your disposal for quality control as a project manager: cause and effect diagrams, control charts, checksheets, scatter diagrams, histograms, Pareto charts, and flowcharts. A cause and effect diagram helps track complaints about quality to the responsible systems so these issues can be resolved at the source. You can use the 5 whys technique, where you ask roughly five questions to peel back the layers and reveal the root cause of an issue. A control chart is a visual representation of the results of processes as time progresses. You can assess whether a process is in control or out of control via the use of a control chart. If a process is in control, it likely does not need to be adjusted. However, processes that are out of control likely require changes. Variations in the results of a process are caused by nonrandom events. It is your responsibility to track down these events and find their common cause. This will allow you to change the process at the source of its issues and create a more predictable result. There is a rule that states that a process should be examined if seven data points in a row are all below or above the mean. This rule is called the seven run rule. A checksheet is a checklist or tally sheet which can be used to collect data about a process. A scatter diagram can assist with showing a relationship between variables of a process. Data points are more closely related if the corresponding data points are closer to a diagonal line.  Scope management relates to quality management because an increase in scope will increase the number of features that need to be assessed for quality. Additionally, problems with quality in features implemented earlier in the software’s development will compound as they affect later features. As a project manager, it is vital for you to address these issues earlier in the development cycle.",
    "author": "Kaleb Dean",
    "url": "/it-project-management/pages/quality-management-scope-management.html",
    "keywords": [
      "sprint2week2",
      "agile",
      "quality control",
      "scope management"
    ]
  },
  {
    "title": "Project Team Management: tools for better managing team resources",
    "img": "Ahmed-team-man-pexels-poranimm-athithawatthee-842401.jpg",
    "content": "",
    "author": "Irzem Ahmed",
    "url": "/it-project-management/pages/project-team-resources-managment.html",
    "keywords": [
      "sprint3week1",
      "agile",
      "Team resources",
      "principles"
    ]
  },
  {
    "title": "Estimating activity resources",
    "img": "estimating-activity-resources.jpg",
    "content": "",
    "author": "Shawn Kiruba",
    "url": "/it-project-management/pages/estimating-activity-resources.html",
    "keywords": [
      "sprint3week1",
      "estimating",
      "activity",
      "resources"
    ]
  },
  {
    "title": "Basics of Project Resource Management",
    "img": "PRM=diagram.png",
    "content": "If you are a current or aspiring Agile project manager working in the sector of information technology, you are probably familiar with the topic of project resource management. You are also looking to enhance your knowledge and skills in being a better project manager that practices Agile methodologies. What does project resource management mean? How is it important in regards to the global state of the current and future workforce in information technology? These questions will be answered as the topic is defined and how it is important.",
    "author": "Daniel Cisneros Siliezar",
    "url": "/it-project-management/pages/resource-man-details.html",
    "keywords": [
      "sprint3week1",
      "agile",
      "management",
      "resources"
    ]
  },
  {
    "title": "Motivation and Influence",
    "img": "motivation-influence.jpeg",
    "content": "As a project manager, you should develop an understanding of how to motivate and influence your team to achieve the success of your project. These skills are non-technical and will transfer over from one project to the next. Throughout your career, you will likely interact with people who have a variety of motivation styles. You will also likely be put in positions where you need to utilize different forms of influence to maintain effectiveness as a leader.  Theories of motivation Psychologists have studied how to motivate people for decades. There are several theories of motivation that are more applicable to your role as a project manager. Intrinsic motivation is what causes people to complete a task or participate in an activity because of their own enjoyment. For example, a chef that honed their skills because they love cooking is intrinsically motivated. Extrinsic motivation is what causes people to complete a task to earn a reward or avoid a penalty. For example, a child will keep their room clean because their parents will not allow them to play with their friends if they do not. Abraham Maslow’s hierarchy of needs is a theory that people are motivated to complete specific needs in a certain order. Physiological needs are at the bottom and include basic needs for the body to function such as food and water. Safety is second and includes physical safety and economic security. Social is the third layer; it includes acceptance, love, affection, and association with a team or group. The fourth layer is esteem which is made up of recognition, prestige, and status. The top layer of Maslow’s hierarchy is self-actualization consisting of challenging projects and opportunities for innovation and creativity. Maslow’s theory suggests that people will strive to accomplish each layer of needs in chronological order. Once satisfied, a need is no longer a motivating factor. Additionally, Maslow suggests that a person cannot satisfy the higher level needs without first handling the ones before. For example, a person cannot successfully pursue self-actualization without first satisfying their need for safety. Need categories one through four are considered deficiency needs while self actualization is considered a growth need. Frederick Herzberg is known for finding a difference between motivational factors and hygiene factors of employment. He defines hygiene factors as anything that could cause dissatisfaction if not present but would not encourage an employee to be more productive. Motivational factors, on the other hand, can influence workers to accomplish more. Some hygiene factors, which would cause dissatisfaction if not present, are larger salaries, more supervision, a more attractive workplace environment, computer or required equipment, health benefits, and training. Some motivational factors are achievement, recognition, work, responsibility, advancement, and growth. David McClelland’s acquired needs theory suggests that an individual's needs are learned or acquired over the course of their life and shaped by their experiences. The primary categories of needs are achievement, affiliation, and power. People with a higher need for achievement seek to excel and avoid both low and high risk situations to improve their chances for success in worthwhile areas of their lives. To manage team members who are achievers, you should give them regular feedback on their performance and challenging projects with achievable goals. Achievers are not necessarily motivated by money, but it is an effective form of feedback. People with a higher need for affiliation search for harmonious relationships with others and need to feel acceptance from people. They are more likely to conform to their work group and prefer work that has higher face to face interaction. To accommodate for your team members who need affiliation, you should strive to create a collaborative work environment. People with a need for power have a desire for either institutional or personal power. People who strive for institutional power want to organize people to further the organization’s goals. Personal power is the need to direct others. People who need personal power can be seen as bossy or micromanaging. Companies should try to put people with a need for organizational power in positions of leadership. As a project manager, try to focus on accomplishing the organization’s goals rather than directing your team members. Douglas McGregor is another psychologist who studied motivation. He is well known for his theories X and Y of motivation. Theory X suggests that employees are motivated to do the least amount of work in exchange for the highest level of security possible. Believers of theory X tend to use coercion, threats, and other control schemes to get employees to stay productive. Theory Y, on the other hand, suggests that employees do not completely dislike work and are motivated by self improvement. You should motivate your team members based on theory Y to get the best results. William Ouchi’s theory Z focuses on how employees view management in contrast to how theories X and Y focus on how managers view employees. Theory Z is based around the Japanese approach to motivation which puts more emphasis on building trust, quality, collective decision making, and cultural values. In theory Z, workers can be trusted to accomplish their work with maximum effort if managers can be trusted to support them and look out for their well being. Ouchi emphasizes job rotation, broadening of skills, generalization rather than specialization, and the need for continuous training.  Influence There are nine ways that project managers have influence over their teams. Authority  Assignment  Budget Promotion Money Penalty Work Challenge Expertise Friendship  Authority is the right to issue orders based on ranking in the organization's hierarchy. Assignment is the project manager’s ability to influence a worker’s placement on future projects. Budget is the perceived ability of a project manager to direct and authorize the use of discretionary funds. Promotion is the ability to give an employee a better position in the company. Money is the ability to increase pay and benefits. Penalty is the degree to which a project manager can dispense or cause punishment. Work challenge is the ability to assign work that taps into a worker’s intrinsic motivation because it maximizes their enjoyment of a particular task. Expertise is the specific knowledge that a project manager has which others consider important. Friendship is the ability of a project manager to establish friendly and healthy relationships with others. According to research conducted by Thamhain and Wilemon, projects are more likely to fail when managers put more emphasis on utilizing authority, money or penalty to influence their teams. On the other hand, teams were found to be more effective when managers focused more on work challenge and expertise, resulting in a higher likelihood of their projects’ success.   With your newfound understanding of motivation and influence, you will be more effective as a team leader. Be sure to focus on using work challenge, expertise, and friendship to have more influence on your team. This will help you establish a positive work environment and will improve the likelihood of your project’s success. Additionally, be mindful of theory Y and Z when trying to motivate your employees. Looking out for your team members will improve their productivity and help the project succeed.",
    "author": "Kaleb Dean",
    "url": "/it-project-management/pages/motivation-influence.html",
    "keywords": ["sprint3week1", "motivation", "influence"]
  }
]